[
  {
    "id": 1,
    "author": "Вася\tПупкин",
    "text": "Это тестовые локальные данные, т.к. ссылка в Items.js не ведет к доступному json \n Добавлены здесь для примера",
    "date": "2012-04-23T18:25:43.511Z",
    "bigText": "Тест Тест Тест \n тест \n \n \n Тест",
    "title": "Это тестовые локальные данные"
  },
  {
    "id": 2,
    "author": "Вася\tПупкин",
    "text": "Появились мощные светодиодные лампы, у которых люминофор нанесён на колбу изнутри. Я изучил и протестировал лампы нового поколения. ",
    "date": "2012-04-23T18:25:43.511Z",
    "bigText": "Обычные светодиодные лампы используют белые светодиоды или COB-сборки, в которых светодиоды, светящие синим светом, покрыты химическим веществом — люминофором, превращающим синий свет в белый.\n\nВ лампах Uniel Profi люминофор нанесён не на светодиоды, а на колбу лампы. У такой технологии есть несколько плюсов:\n\nлюминофор не выгорает от нагрева и лампы служат гораздо дольше без изменений цветовых характеристик;лампы имеют более высокую эффективность.\nМинус технологии в том, что люминофора требуется гораздо больше, а он недёшев.\n\nЛампы Uniel Profi предназначены для освещения производственных помещений, складов, и других объектов, где требуются мощные источники света.\n\nЯ протестировал все четыре лампы серии Uniel Profi: \n\nLED-MP200-50W-4000K-E27-PH ALP06WH — 50 Вт, 6500 лм, цоколь E27, цветовая температура 4000K;\nLED-MP200-50W-6000K-E27-PH ALP06WH — 50 Вт, 6500 лм, цоколь E27, цветовая температура 6000K; \nLED-MP200-80W-4000K-E40-PH ALP06WH — 80 Вт, 10000 лм, цоколь E40, цветовая температура 4000K; \nLED-MP200-80W-6000K-E40-PH ALP06WH — 80 Вт, 10000 лм, цоколь E40, цветовая температура 6000K.\n\nОбычная лампа накаливания на фото поможет оценить внушительные размеры мощных ламп.",
    "title": "Мощные светодиодные лампы нового поколения"
  },
  {
    "id": 3,
    "author": "Жулик не Воруй",
    "text": "На написание данной статьи меня вдохновила статья об анализе Сишного printf. Однако, там был пропущен момент о том, какой путь проходят данные после того, как они попадают в терминальное устройство. В данной статье я хочу исправить этот недочет и проанализировать путь данных в терминале. Также мы разберемся, чем отличается Terminal от Shell, что такое Pseudoterminal, как работают эмуляторы терминалов и многое другое.",
    "bigText": "xxx Основы\nДавайте для начала разберемся, что такое Terminal, Shell, Console, чем отличается Terminal Emulator от обычного Terminal и почему он так назван. Информации об этом написано уже довольно много, поэтому \nничего нового вы здесь не услышите. Почти вся информация здесь была взята из интернета, ссылки приведу в конце статьи. Кто уже знает, что все эти вещи обозначают, может смело пропускать данный раздел.\n\n\nTerminal\nTerminal (терминал) — это комбинация дисплея и клавиатуры, то есть физическое устройство. До того, как терминалы стали именно данной комбинацией, они являлись неким устройством под названием teleprinter (teletype, teletypewriter или TTY сокращенно), то есть комбинацией принтера и клавиатуры. Обычно несколько терминалов подключались к одному и тому же компьютеру. Таким образом возможно было работать нескольким пользователям за одним и тем же компьютером, причем каждому выделялась своя сессия, независимая от других. Терминал был назван так потому, что он находился на конце терминального кабеля (terminal end).",
    "date": "2015-09-21T19:27:43.511Z",
    "title": "Hello, World! Глубокое погружение в Терминалы"
  },
  {
    "id": 4,
    "author": "Президент\tКомнаты",
    "text": "Когда на орбите оказался первый спутник, инструкции, как его можно наблюдать, публиковали в газетах. Но почти сразу к мирным научным и народно-хозяйственным спутникам добавились военные, о конструкции, назначении и параметрах орбиты которых государства уже не имели никакого желания рассказывать. ",
    "bigText": "На фото слева — поворотное крепление спутников, использующих разгонный блок IUS (Inertial Upper Stage). Именно он должен был вывести предполагаемую полезную нагрузку. Однако опубликованная фотография миссии STS-38 (справа) не содержит никаких следов громоздкого оборудования. Следовательно, полезная нагрузка была другой.\n\nЭнтузиасты, наблюдающие за низкой орбитой, не обнаружили нового спутника, так что версия Aviation Week оказалась несостоятельной. Запущенный аппарат, официально объявленный как USA-67, располагался на геостационарной орбите. Но интрига еще не закончилась. В официально публикуемом каталоге космических объектов к STS-38 были отнесены две записи — USA-67 и “ступень разгонного блока”. Проблема — на спутниках SDS-2, которым, предположительно, являлся USA-67, был встроенный в конструкцию и не сбрасываемый апогейный двигатель. Неужели шаттл вывел не один спутник, а два?",
    "date": "2015-11-13T18:22:43.511Z",
    "title": "Охота на космические инспекторы"
  },
  {
    "id": 5,
    "author": "Мистер Сосистер",
    "text": "Цель публикации: рассказать, как подготовить несложную радиолюбительскую конструкцию к производству.",
    "bigText": "Процесс автоматизированного монтажа  печатной платы обычно состоит из следующих этапов:\n\n сигареты Изготовление печатной платы (PCB).Нанесение на печатную плату паяльной пасты.Установка на печатную плату (Pick&Place) компонентов SMD.Оплавление паяльной пасты в печи.(При необходимости) Монтаж на нижнюю сторону платы компонентов SMD.(При необходимости) Монтаж на печатную плату компонентов THT (Through-Hole).Отмывка собранного печатного узла. Сушка.Технический контроль качества монтажа компонентов.(При необходимости) Ремонт собранного печатного узла.(При необходимости) Нанесение покрытий.\nКак изготовить печатную плату на китайской фабрике, я описал в предыдущей статье цикла. При подготовке проекта к производству необходимо помнить о том, что:",
    "date": "2015-05-23T15:25:43.511Z",
    "title": "Радиолюбительская технология: как я заказал монтаж печатной платы на китайской фабрике"
  },
  {
    "id": 6,
    "author": "Нео ",
    "text": "Вот видишь ты на улице пёсика. Ты всегда видишь на улице пёсиков. Вот кто-то вообще их не замечает и не имеет хлопот, вот нет этих душевных терзаний, и вообще можно считать, что им на улице норм. Но ты же! И заметил, и глаза у тебя на мокром месте, такой думаешь: «пёсик. уаа, такой миленький, взял бы но не могу. Но вот прям точно, но никак». И пошёл такой дальше. Но пофотал его, погладил.",
    "bigText": "Концепция\nВ рамках направления Machine Learning for Social Good сообщества Open Data Science мы вместе с 9851754 и нашей командой делаем сервис для поиска пропавших животных, в котором владелец может указать фото животного, адрес пропажи и другие характеристики, а в ответ получить наиболее релевантные с точки зрения нашего алгоритма сообщения о найденных или увиденных животных.\n\nКраткий алгоритм работы нашего сервиса: мы агрегируем данные(фото, место находки, порода итд) с нескольких сайтов, преобразуем изображения нейронной сетью в вектор, обучаем knn и показываем ближайших соседей введённой фотографии. Ты находишь потерянное животное, животное возвращается домой. Все довольны)",
    "date": "2013-04-23T13:25:43.511Z",
    "title": "Собаку съел на нейронных сетях"
  },
  {
    "id": 7,
    "author": "Илон но не Маск",
    "text": "Предыдущая статья про баланс персонажей и снаряжения собрала много отзывов и я решил не тянуть с продолжением.\nТогда мы разобрали самую основу — как посчитать абстрактную силу сущности и как эта сила меняется по ходу ее жизни. Сегодня увеличим масштаб и посмотрим, как баланс зависит не от конкретных ситуаций, а от фундаментальных правил или динамики развития игры.\n\nБонусом в конце — несколько ссылок по теме.",
    "bigText": "Баланс, экономика и прогрессия\nПродолжим тему RPG и мечей (все еще рекомендую начать с прошлой статьи, если вы не знаете, о чем я). Например, в Diablo игрок выбивает из бочек золото, чтобы потом купить на него новый, более крутой меч. \n\nСколько должен стоить обычный меч с единицей урона? Не знаю, придумайте сами, это не так важно. Я возьму 10 золота за меч с 1 урона. Главный вопрос — сколько тогда будет стоить меч с 2 урона? Наверное, 20 золота? А с 5 урона? Очевидно, 50.\n\nИ да и нет. Сначала вы могли задаваться вопросом: а какие правила нашей игры, как она работает? В зависимости от механик, меч с 5 урона может стоить и 50 и 150 золота. \n\nПредставим, что у всех врагов 5 единиц жизней. Для игрока это значит, что с мечом, у которого 1 урона, ему понадобится 5 атак, чтобы убить врага. Если меч с 2 урона — 3 атаки, с 3 или 4 урона — 2 атаки. И одна атака мечом с 5 урона.\nИ это очень важно — чем меньше время жизни врага, тем меньше урона он успеет нанести.\n\nПолучается, что, покупая меч с большим уроном, вы не только получаете в свое распоряжение эту силу, но и экономите HP. Значит, в такой игре каждая следующая единица урона ценнее, чем предыдущая настолько, сколько HP она позволяет сэкономить.",
    "date": "2015-07-23T17:27:43.511Z",
    "title": "Курс Молодого Геймдизайнера: баланс прогрессии и динамики без математики"
  }
]
